using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace ChooseBot.Configs
{
    public class AdditionalCharacteristics
    {
        public readonly static List<string> AdditionalList = new List<string>
        {
            "Преуспевал в учебе и был умнее сверстников",
            "Состояние здоровья стремительно ухудшается",
            "Нашел запас медикаментов",
            "Проходил курсы психологa",
            "Умеет вскрывать замки",
            "Очень много врет",
            "Может спасти еще одного человека, если спасется сам",
            "Любит животных",
            "Нашел небольшой запас еды",
            "Вы слишком добрый, поэтому уступаете шанс на спасение любому игроку",
            "Из-за выработки адреналина резко улучшилось здоровье",
            "Есть с собой чемоданчик с большой суммой денег",
            "Выиграл в лотерею",
            "Помешан на теории заговора",
            "Умеет манипулировать людьми",
            "Остался почти невредимым после встречи с медведем",
            "Любит горячую выпечку",
            "Впадает в глубокую депрессию в связи с тяжелой ситуацией",
            "Пересмотрел кучу передач про выживание",
            "Вы настолько убедительны, что в одном из раундов ваш голос будет считаться за два",
            "Вы очень хороший лжец и можете скрыть одну любую характеристику",
            "Вы находите аптечкy",
            "Вы находите бинты",
            "Вы находите обеззараживающие средство",
            "Потерял предметы своего багажа",
            "Обожает читать книги",
            "Появилась сильная боязнь воды",
            "Очень сильно паникует и не может успокоиться",
            "Начались проблемы с дыханием из-за стрессовой ситуации",
            "Знает множество интересных историй",
            "Знает 6 языков",
            "Носит на себе множество дорогих украшений",
            "Непрофессионал своего дела",
            "Соврал про свою профессию, никогда раньше не работал",
            "Очень быстро учится новым навыкам",
            "Непереносимость лактозы",
            "Развивается сильная боязнь высоты, психическое здоровье ухудшается",
            "Обладает навыками выживания",
            "Нашел три книги про путешествия",
            "Очень эгоистичный",
        };
    }
}
