using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace ChooseBot.Configs
{
    public class StringConfigs
    {
        public const string HelloString = "Наш мир не так прост, как кажется: миллионы опасностей каждый день поджидают нас за углом. К ним никогда нельзя быть готовым, но есть люди, которые лучше других способны выбираться из опасных ситуаций. Пришло время испытать себя на прочность. Сможете ли вы выжить на необитаемом острове или в заснеженных горах? Самое время мобилизовать все свои силы! Главное – не забывать о навыках переговоров и убеждения! Но и милосердию всегда должно быть место в этом мире.";
        public const string Rules = "Вы попадаете в определенную опасную ситуацию. Опасности бывают двух видов.\n"+
            "В первом случае, смогут выбраться все, но определенное количество людей сделает это раньше.Ваша задача в таком случае – убедить всех вокруг, что именно вы должны быть в первой партии спасенных, ведь вы не так сильны, как другие.Да и оставшаяся часть людей может ждать помощи слишком долго...\n" +
            "Во втором случае, вам придется доказать, что без вас человечеству не выжить, ведь недавно на Земле случилась катастрофа и без здоровых и сильных людей не обойтись. Но, к сожалению, мест в спасательном бункере не так много…\n" +
            "Перед началом игры участники должны распределить между собой порядковые номера и запомнить их.\n"+
            "Начинаем нашу игру!\n"+
            "Вы получите сообщение, где будет полностью описана ситуация, в которой оказалась ваша команда.\n" +
            "Далее будут высылаться сообщения с номером игрока и соответствующим ему персонажем.Ведущему или кому-то из участников игры нужно переслать сообщение с характеристикой персонажа игроку с указанным номером.\n"+
            "У каждого персонажа будут прописаны следующие характеристики:\n"+
            "Профессия\n"+
            "Биологические характеристики (Пол, возраст)\n"+
            "Состояние здоровья\n" +
            "Личные качества\n"+
            "Увлечения\n"+
            "Фобии\n"+
            "Предметы";
    }
}
